tutorials/cases/prescribedUsCases/vortexIrrotational/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  v2406
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     porousGasificationFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         0.5;

// Fixed step (adjustTimeStep off) so the committed baseline is deterministic.
// Solid Courant Us*dt/dx = 0.01*0.002/0.001 = 0.02, well within the div
// scheme's stability limit.
deltaT          0.002;

writeControl    runTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo      1;

maxDi      5000;

functions
{
    #includeIfPresent "regressionFunctions"
}

// ************************************************************************* //
