tutorials/cases/prescribedUsCases/vortexIrrotational/constant/reactions
species
(
    N2
);

reactions
{
}
